Catalogs/ИзделияЗаказчика.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>ИзделияЗаказчика</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ЕдиницаИзмерения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЕдиницыИзмерения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>7</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПолноеНаименование</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПомещенияСтрокой</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РазмерПоТЗ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Проект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Проекты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦенаВДоговоре</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ИзделияЭлемент</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИзделиеЭлемент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ИзделияЭлемент</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Комментарий</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Помещения</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Помещение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Помещения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

CommonModules/омИзделиеЗаказчика/Ext/Module.bsl
&НаСервере
Функция ПолучитьПомещенияИзделияЗаказчика(ИзделиеЗаказчика, МассивПомещений = Неопределено) Экспорт
	МассивПомещений = Новый Массив;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ИзделияЗаказчикаИзделияЭлемент.Ссылка КАК ИзделиеЗаказчика,
		|	ИзделияЗаказчикаИзделияЭлемент.ИзделиеЭлемент.Помещения КАК Помещения
		|ИЗ
		|	Справочник.ИзделияЗаказчика.ИзделияЭлемент КАК ИзделияЗаказчикаИзделияЭлемент
		|ГДЕ
		|	ИзделияЗаказчикаИзделияЭлемент.Ссылка В(&Ссылка)
		|
		|СГРУППИРОВАТЬ ПО
		|	ИзделияЗаказчикаИзделияЭлемент.ИзделиеЭлемент.Помещения,
		|	ИзделияЗаказчикаИзделияЭлемент.Ссылка
		|
		|УПОРЯДОЧИТЬ ПО
		|	ИзделияЗаказчикаИзделияЭлемент.ИзделиеЭлемент.Помещения.Наименование";
	
	Запрос.УстановитьПараметр("Ссылка", ИзделиеЗаказчика);
	
	РезультатЗапроса = Запрос.Выполнить(); 
	
	Если ТипЗнч(ИзделиеЗаказчика) = Тип("Массив") Тогда
		тзВозврата = Новый ТаблицаЗначений;
		тзВозврата.Колонки.Добавить("ИзделиеЗаказчика", Новый ОписаниеТипов("СправочникСсылка.ИзделияЗаказчика"));
		тзВозврата.Колонки.Добавить("Помещения", Новый ОписаниеТипов("Строка"));
		

		тзВыгрузка =  РезультатЗапроса.Выгрузить();
		
		мИзделияЗаказчика = Новый Массив;
		Для каждого х Из тзВыгрузка Цикл
			Если мИзделияЗаказчика.Найти(х.ИзделиеЗаказчика) = Неопределено Тогда
				
				мИзделияЗаказчика.Добавить(х.ИзделиеЗаказчика);	
				
			КонецЕсли;	
		КонецЦикла; 
		
		стОтбор = Новый Структура("ИзделиеЗаказчика", ); 
		
		Для каждого ИзделиеЗаказчика Из мИзделияЗаказчика Цикл
			стОтбор.ИзделиеЗаказчика = ИзделиеЗаказчика;
			НайденыеСтроки = тзВыгрузка.НайтиСтроки(стОтбор);
			стрПомещение = "";
			
			Для каждого х Из НайденыеСтроки Цикл
				стрПомещение = омРаботаССтроками.ДобавитьРазделительНеПустойСтроке(стрПомещение) + х.Помещения;
			КонецЦикла;
			
		    НС = тзВозврата.Добавить();
			НС.ИзделиеЗаказчика = ИзделиеЗаказчика;
			НС.Помещения 		= стрПомещение;
		КонецЦикла;
				
		Возврат тзВозврата;
		
		//Возврат ОбщегоНазначения.ТаблицаЗначенийВМассив(тзВозврата);	
	КонецЕсли;
	
	Выборка = РезультатЗапроса.Выбрать();
	
	стрВозврата = "";
	
	Пока Выборка.Следующий() Цикл
		стрВозврата = омРаботаССтроками.ДобавитьРазделительНеПустойСтроке(стрВозврата) + Выборка.Помещения;
		ДобавитьПомещениеВМассив(МассивПомещений,Выборка.Помещения);
	КонецЦикла;
	

	Возврат стрВозврата;

КонецФункции // ПолучитьПомещенияИзделияЗаказчика() 

&НаСервере
Процедура ДобавитьПомещениеВМассив(МассивПомещений, Помещение)

	Если МассивПомещений.Найти(Помещение) = Неопределено Тогда
	
		МассивПомещений.Добавить(Помещение);	
	
	КонецЕсли;	
	
КонецПроцедуры // ДобавитьПомещениеВМассив()
